#include <arpa/inet.h>
#include <libgen.h>
#include <liburing.h>
#include <memory.h>
#include <netinet/in.h>
#include <poll.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <sys/socket.h>
#include <unistd.h>

#include "./tsil.h"

ціле бібц__ю8_в_кд(п8* дані,
                   природне розмір,
                   п8** рез_дані,
                   природне* рез_розмір,
                   природне* рез_позиція_помилки);

ціле бібц__кд_в_ю8(п8* дані,
                   природне розмір,
                   п8** рез_дані,
                   природне* рез_розмір,
                   природне* рез_позиція_помилки);

п8* бібц__виділити(природне розмір) {
  return malloc(розмір);
}

п8* бібц__перевиділити(п8* значення, природне новий_розмір) {
  return realloc(значення, новий_розмір);
}

void бібц__звільнити(п8* значення) {
  free(значення);
}

void бібц__друк_кд(п8* дані, природне розмір) {
  ціле статус;
  п8* дані_ю8;
  природне розмір_ю8;
  природне позиція_помилки;

  статус = бібц__кд_в_ю8(дані, розмір, &дані_ю8, &розмір_ю8, &позиція_помилки);
  if (статус != 0) {
    return;
  }

  fwrite(дані_ю8, розмір_ю8, 1, stdout);
}

void бібц__друк_ю8(п8* дані, природне розмір) {
  fwrite(дані, розмір, 1, stdout);
}

void бібц__друк_п64(п64 значення) {
  printf("%lu", значення);
}

void бібц__друк_ц64(ц64 значення) {
  printf("%ld", значення);
}

void бібц__друк_р64(р64 значення) {
  printf("%lf", значення);
}