#include <stdio.h>

#include "./tsil.h"

ціле бібц__ю8_в_кд(п8* дані,
                   природне розмір,
                   природне з_нульовим_байтом_в_кінці,
                   п8** рез_дані,
                   природне* рез_розмір,
                   природне* рез_позиція_помилки);

ціле бібц__кд_в_ю8(п8* дані,
                   природне розмір,
                   природне з_нульовим_байтом_в_кінці,
                   п8** рез_дані,
                   природне* рез_розмір,
                   природне* рез_позиція_помилки);

адреса бібц__виділити(природне розмір) {
  return malloc(розмір);
}

адреса бібц__перевиділити(адреса значення, природне новий_розмір) {
  return realloc(значення, новий_розмір);
}

void бібц__звільнити(адреса значення) {
  free(значення);
}

void бібц__друк_кд(п8* дані, природне розмір) {
  ціле статус;
  п8* дані_ю8;
  природне розмір_ю8;
  природне позиція_помилки;

  статус =
      бібц__кд_в_ю8(дані, розмір, 0, &дані_ю8, &розмір_ю8, &позиція_помилки);
  if (статус != 0) {
    return;
  }

  fwrite(дані_ю8, розмір_ю8, 1, stdout);
}

void бібц__друк_ю8(п8* дані, природне розмір) {
  fwrite(дані, розмір, 1, stdout);
}

void бібц__друк_п64(п64 значення) {
  printf("%lu", значення);
}

void бібц__друк_ц64(ц64 значення) {
  printf("%ld", значення);
}

void бібц__друк_р64(р64 значення) {
  printf("%lf", значення);
}