#!/usr/bin/env sh
set -x
set -e

mkdir -p out
mkdir -p build/ПМ
mkdir -p build/КЦ
mkdir -p build/КЦ/розбирач
mkdir -p build/біб

ціль build/КЦ/перекладач/Дія.ю8.ll скомпілювати КЦ/перекладач/Дія.ю8.ц
ціль build/КЦ/Помилка.ю8.ll скомпілювати КЦ/Помилка.ю8.ц
ціль build/КЦ/перекладач/Тіло.ю8.ll скомпілювати КЦ/перекладач/Тіло.ю8.ц
ціль build/КЦ/перекладач/ВаріативнийТип.ю8.ll скомпілювати КЦ/перекладач/ВаріативнийТип.ю8.ц
ціль build/КЦ/перекладач/Вернути.ю8.ll скомпілювати КЦ/перекладач/Вернути.ю8.ц
ціль build/КЦ/перекладач/Крок.ю8.ll скомпілювати КЦ/перекладач/Крок.ю8.ц
ціль build/КЦ/перекладач/Стрибнути.ю8.ll скомпілювати КЦ/перекладач/Стрибнути.ю8.ц
ціль build/КЦ/перекладач/Обʼєкт.ю8.ll скомпілювати КЦ/перекладач/Обʼєкт.ю8.ц
ціль build/КЦ/розбирач/розбирач.ю8.ll скомпілювати КЦ/розбирач/розбирач.ю8.ц
ціль build/старт.ю8.ll скомпілювати старт.ю8.ц
ціль build/ПМ/ПМ.ю8.ll скомпілювати ПМ/ПМ.ю8.ц
ціль build/КЦ/КЦ.ю8.ll скомпілювати КЦ/КЦ.ю8.ц
ціль build/КЦ/Обʼєкт.ю8.ll скомпілювати КЦ/Обʼєкт.ю8.ц
ціль build/КЦ/ОбʼєктДії.ю8.ll скомпілювати КЦ/ОбʼєктДії.ю8.ц
ціль build/КЦ/ОбʼєктНезавантаженогоЗначення.ю8.ll скомпілювати КЦ/ОбʼєктНезавантаженогоЗначення.ю8.ц
ціль build/КЦ/ОбʼєктСекції.ю8.ll скомпілювати КЦ/ОбʼєктСекції.ю8.ц
ціль build/КЦ/ОбʼєктСирогоЗначення.ю8.ll скомпілювати КЦ/ОбʼєктСирогоЗначення.ю8.ц
ціль build/КЦ/ОбʼєктШаблону.ю8.ll скомпілювати КЦ/ОбʼєктШаблону.ю8.ц
ціль build/КЦ/ОбʼєктЗначення.ю8.ll скомпілювати КЦ/ОбʼєктЗначення.ю8.ц
ціль build/КЦ/ОбʼєктТипу.ю8.ll скомпілювати КЦ/ОбʼєктТипу.ю8.ц
ціль build/КЦ/перекладач/Взяти.ю8.ll скомпілювати КЦ/перекладач/Взяти.ю8.ц
ціль build/КЦ/перекладач/ВиконатиДію.ю8.ll скомпілювати КЦ/перекладач/ВиконатиДію.ю8.ц
ціль build/КЦ/перекладач/ВиконатиШаблон.ю8.ll скомпілювати КЦ/перекладач/ВиконатиШаблон.ю8.ц
ціль build/КЦ/перекладач/ЗмінитиВСередовищі.ю8.ll скомпілювати КЦ/перекладач/ЗмінитиВСередовищі.ю8.ц
ціль build/КЦ/перекладач/Значення.ю8.ll скомпілювати КЦ/перекладач/Значення.ю8.ц
ціль build/КЦ/перекладач/Операція.ю8.ll скомпілювати КЦ/перекладач/Операція.ю8.ц
ціль build/КЦ/перекладач/ОтриматиЗСередовища.ю8.ll скомпілювати КЦ/перекладач/ОтриматиЗСередовища.ю8.ц
ціль build/КЦ/перекладач/ОтриматиВластивість.ю8.ll скомпілювати КЦ/перекладач/ОтриматиВластивість.ю8.ц
ціль build/КЦ/перекладач/ОтриматиЕлемент.ю8.ll скомпілювати КЦ/перекладач/ОтриматиЕлемент.ю8.ц
ціль build/КЦ/перекладач/ОтриматиСекційнуВластивість.ю8.ll скомпілювати КЦ/перекладач/ОтриматиСекційнуВластивість.ю8.ц
ціль build/КЦ/перекладач/ЗмінитиВластивість.ю8.ll скомпілювати КЦ/перекладач/ЗмінитиВластивість.ю8.ц
ціль build/КЦ/перекладач/ЗмінитиСекційнуВластивість.ю8.ll скомпілювати КЦ/перекладач/ЗмінитиСекційнуВластивість.ю8.ц
ціль build/КЦ/перекладач/ЗмінитиЕлемент.ю8.ll скомпілювати КЦ/перекладач/ЗмінитиЕлемент.ю8.ц
ціль build/КЦ/перекладач/Поки.ю8.ll скомпілювати КЦ/перекладач/Поки.ю8.ц
ціль build/КЦ/перекладач/Якщо.ю8.ll скомпілювати КЦ/перекладач/Якщо.ю8.ц
ціль build/КЦ/перекладач/Секція.ю8.ll скомпілювати КЦ/перекладач/Секція.ю8.ц
ціль build/КЦ/перекладач/Синонім.ю8.ll скомпілювати КЦ/перекладач/Синонім.ю8.ц
ціль build/КЦ/перекладач/Текст.ю8.ll скомпілювати КЦ/перекладач/Текст.ю8.ц
ціль build/КЦ/перекладач/Структура.ю8.ll скомпілювати КЦ/перекладач/Структура.ю8.ц
ціль build/КЦ/перекладач/Однооперація.ю8.ll скомпілювати КЦ/перекладач/Однооперація.ю8.ц
ціль build/КЦ/перекладач/Ціль.ю8.ll скомпілювати КЦ/перекладач/Ціль.ю8.ц
ціль build/КЦ/перекладач/Число.ю8.ll скомпілювати КЦ/перекладач/Число.ю8.ц
ціль build/КЦ/перекладач/Шаблон.ю8.ll скомпілювати КЦ/перекладач/Шаблон.ю8.ц
ціль build/КЦ/перекладач/ТипДії.ю8.ll скомпілювати КЦ/перекладач/ТипДії.ю8.ц
ціль build/КД/КД.ю8.ll скомпілювати КД/КД.ю8.ц

clang -c -o build/біб/bib.o біб/bib.c
clang -c -o build/ext.o ext.c

clang++ -o out/старт \
  build/старт.ю8.ll \
  build/КЦ/розбирач/розбирач.ю8.ll \
  build/КЦ/перекладач/ВаріативнийТип.ю8.ll \
  build/КЦ/перекладач/Вернути.ю8.ll \
  build/КЦ/перекладач/Взяти.ю8.ll \
  build/КЦ/перекладач/ВиконатиДію.ю8.ll \
  build/КЦ/перекладач/ВиконатиШаблон.ю8.ll \
  build/КЦ/перекладач/Дія.ю8.ll \
  build/КЦ/перекладач/ЗмінитиВСередовищі.ю8.ll \
  build/КЦ/перекладач/Значення.ю8.ll \
  build/КЦ/перекладач/Крок.ю8.ll \
  build/КЦ/перекладач/Обʼєкт.ю8.ll \
  build/КЦ/перекладач/Операція.ю8.ll \
  build/КЦ/перекладач/ОтриматиЗСередовища.ю8.ll \
  build/КЦ/перекладач/ОтриматиВластивість.ю8.ll \
  build/КЦ/перекладач/ОтриматиЕлемент.ю8.ll \
  build/КЦ/перекладач/ОтриматиСекційнуВластивість.ю8.ll \
  build/КЦ/перекладач/ЗмінитиВластивість.ю8.ll \
  build/КЦ/перекладач/ЗмінитиСекційнуВластивість.ю8.ll \
  build/КЦ/перекладач/ЗмінитиЕлемент.ю8.ll \
  build/КЦ/перекладач/Поки.ю8.ll \
  build/КЦ/перекладач/Якщо.ю8.ll \
  build/КЦ/перекладач/Однооперація.ю8.ll \
  build/КЦ/перекладач/Ціль.ю8.ll \
  build/КЦ/перекладач/Число.ю8.ll \
  build/КЦ/перекладач/Шаблон.ю8.ll \
  build/КЦ/перекладач/Секція.ю8.ll \
  build/КЦ/перекладач/Структура.ю8.ll \
  build/КЦ/перекладач/Синонім.ю8.ll \
  build/КЦ/перекладач/Стрибнути.ю8.ll \
  build/КЦ/перекладач/Текст.ю8.ll \
  build/КЦ/перекладач/ТипДії.ю8.ll \
  build/КЦ/перекладач/Тіло.ю8.ll \
  build/КЦ/КЦ.ю8.ll \
  build/КЦ/Обʼєкт.ю8.ll \
  build/КЦ/ОбʼєктДії.ю8.ll \
  build/КЦ/ОбʼєктНезавантаженогоЗначення.ю8.ll \
  build/КЦ/ОбʼєктСекції.ю8.ll \
  build/КЦ/ОбʼєктСирогоЗначення.ю8.ll \
  build/КЦ/ОбʼєктШаблону.ю8.ll \
  build/КЦ/ОбʼєктЗначення.ю8.ll \
  build/КЦ/ОбʼєктТипу.ю8.ll \
  build/КЦ/Помилка.ю8.ll \
  build/ПМ/ПМ.ю8.ll \
  build/КД/КД.ю8.ll \
  build/ext.o \
  build/біб/bib.o \
  інструкція_llvm.cpp \
  `llvm-config --cxxflags --ldflags --system-libs --libs`