extern "C" {
#define АСДВидНіщо 0
#define АСДВидПеревизначити 1
#define АСДВидЗвернутись 2
#define АСДВидОтримати 3
#define АСДВидОтриматиЗіСекції 4
#define АСДВидОтриматиЗаПозицією 5
#define АСДВидЗмінити 6
#define АСДВидЗмінитиВСекції 7
#define АСДВидЗмінитиЗаПозицією 8
#define АСДВидВиконати 9
#define АСДВидВиконатиШаблон 10
#define АСДВидСтворитиЦіль 11
#define АСДВидСтворитиДію 12
#define АСДВидСтворитиСтруктуру 13
#define АСДВидСтворитиСинонім 14
#define АСДВидСтворитиШаблон 15
#define АСДВидСтворитиСекцію 16
#define АСДВидСтворитиОбʼєкт 17
#define АСДВидЗначенняЧисло 18
#define АСДВидЗначенняТекст 19
#define АСДВидЗначенняЮнікод 20
#define АСДВидОперація 21
#define АСДВидЯкщо 22
#define АСДВидПоки 23
#define АСДВидВернути 24
#define АСДВидСтворитиТипДії 25
#define АСДВидСтворитиТипМасиву 26
#define АСДВидЗначенняЯкщо 27

#define АСДОпераціяМноження 1
#define АСДОпераціяДілення 2
#define АСДОпераціяМодуль 3
#define АСДОпераціяДодавання 4
#define АСДОпераціяВіднімання 5
#define АСДОпераціяЗсувВліво 6
#define АСДОпераціяЗсувВправо 7
#define АСДОпераціяЗсувВправоЗнаковий 8
#define АСДОпераціяМенше 9
#define АСДОпераціяБільше 10
#define АСДОпераціяМеншеРівне 11
#define АСДОпераціяБільшеРівне 12
#define АСДОпераціяРівне 13
#define АСДОпераціяНерівне 14
#define АСДОпераціяДІ 15
#define АСДОпераціяВАБО 16
#define АСДОпераціяДАБО 17
#define АСДОпераціяІ 18
#define АСДОпераціяАБО 19
#define АСДОпераціяЯк 20

#define АСДВидимістьЗовнішня 0
#define АСДВидимістьМісцева 1
#define АСДВидимістьВнутрішня 2

struct Місцезнаходження;
struct АСДЗначення;
struct СписокАСДЗначень;

struct Ідентифікатор;
struct Параметр;

struct АСДДаніПеревизначити;
struct АСДДаніЗвернутись;
struct АСДДаніОтримати;
struct АСДДаніОтриматиЗіСекції;
struct АСДДаніОтриматиЗаПозицією;
struct АСДДаніЗмінити;
struct АСДДаніЗмінитиВСекції;
struct АСДДаніЗмінитиЗаПозицією;
struct АСДДаніВиконати;
struct АСДДаніВиконатиШаблон;
struct АСДДаніСтворитиЦіль;
struct АСДДаніСтворитиДію;
struct АСДДаніСтворитиСтруктуру;
struct АСДДаніСтворитиСинонім;
struct АСДДаніСтворитиШаблон;
struct АСДДаніСтворитиСекцію;
struct АСДДаніСтворитиОбʼєкт;
struct АСДДаніЗначенняЧисло;
struct АСДДаніЗначенняТекст;
struct АСДДаніЗначенняЮнікод;
struct АСДДаніОперація;
struct АСДДаніЯкщо;
struct АСДДаніПоки;
struct АСДДаніВернути;
struct АСДДаніСтворитиТипДії;
struct АСДДаніСтворитиТипМасиву;
struct АСДДаніЗначенняЯкщо;

struct ТекстКоду;
struct ПомилкаРозборуЦілі;
struct РезультатРозборуЦілі;

struct Місцезнаходження {
  ТекстКоду* текст_коду;
  size_t рядок;
  size_t стовпець;
};

struct АСДЗначення {
  size_t вид;
  void* дані;
  Місцезнаходження* місцезнаходження;
};

struct СписокАСДЗначень {
  size_t довжина;
  АСДЗначення** елементи;
};

struct Ідентифікатор {
  char* значення;
  Місцезнаходження* місцезнаходження;
};

struct Параметр {
  Ідентифікатор* ідентифікатор;
  АСДЗначення* тип;
  Місцезнаходження* місцезнаходження;
};

struct АСДДаніПеревизначити {
  Ідентифікатор* ідентифікатор;
  АСДЗначення* значення;
};

struct АСДДаніЗвернутись {
  Ідентифікатор* ідентифікатор;
};

struct АСДДаніОтримати {
  АСДЗначення* обʼєкт;
  Ідентифікатор* ідентифікатор;
};

struct АСДДаніОтриматиЗіСекції {
  АСДЗначення* обʼєкт;
  Ідентифікатор* ідентифікатор;
};

struct АСДДаніОтриматиЗаПозицією {
  АСДЗначення* обʼєкт;
  АСДЗначення* позиція;
};

struct АСДДаніЗмінити {
  АСДЗначення* обʼєкт;
  Ідентифікатор* ідентифікатор;
  АСДЗначення* значення;
};

struct АСДДаніЗмінитиВСекції {
  АСДЗначення* обʼєкт;
  Ідентифікатор* ідентифікатор;
  АСДЗначення* значення;
};

struct АСДДаніЗмінитиЗаПозицією {
  АСДЗначення* обʼєкт;
  АСДЗначення* позиція;
  АСДЗначення* значення;
};

struct АСДДаніВиконати {
  АСДЗначення* обʼєкт;
  СписокАСДЗначень* аргументи;
};

struct АСДДаніВиконатиШаблон {
  АСДЗначення* обʼєкт;
  СписокАСДЗначень* аргументи;
};

struct АСДДаніСтворитиЦіль {
  size_t змінна;
  size_t стала;
  Ідентифікатор* ідентифікатор;
  АСДЗначення* тип;
  АСДЗначення* значення;
};

struct АСДДаніСтворитиДію {
  size_t видимість;
  Ідентифікатор* ідентифікатор;
  size_t кількість_параметрів;
  Параметр** параметри;
  АСДЗначення* тип_результату;
  СписокАСДЗначень* тіло;
};

struct АСДДаніСтворитиСтруктуру {
  Ідентифікатор* ідентифікатор;
  size_t кількість_параметрів;
  Параметр** параметри;
};

struct АСДДаніСтворитиСинонім {
  АСДЗначення* значення;
};

struct АСДДаніСтворитиШаблон {
  Ідентифікатор* ідентифікатор;
  size_t кількість_параметрів;
  Ідентифікатор** параметри;
  АСДЗначення* значення;
};

struct АСДДаніСтворитиСекцію {
  Ідентифікатор* ідентифікатор;
  СписокАСДЗначень* тіло;
};

struct АСДДаніСтворитиОбʼєкт {
  АСДЗначення* тип;
  СписокАСДЗначень* аргументи;
};

struct АСДДаніЗначенняЧисло {
  char* значення;
};

struct АСДДаніЗначенняТекст {
  char* значення;
};

struct АСДДаніЗначенняЮнікод {
  Ідентифікатор* ідентифікатор;
  char* значення;
};

struct АСДДаніОперація {
  АСДЗначення* ліво;
  size_t операція;
  АСДЗначення* право;
};

struct АСДДаніЯкщо {
  АСДЗначення* умова;
  СписокАСДЗначень* тіло;
  СписокАСДЗначень* тіло_інакше;
};

struct АСДДаніПоки {
  АСДЗначення* умова;
  СписокАСДЗначень* тіло;
};

struct АСДДаніВернути {
  АСДЗначення* значення;
};

struct АСДДаніСтворитиТипДії {
  size_t кількість_параметрів;
  Параметр** параметри;
  АСДЗначення* тип_результату;
};

struct АСДДаніСтворитиТипМасиву {
  АСДЗначення* тип;
  АСДЗначення* розмір;
};

struct АСДДаніЗначенняЯкщо {
  АСДЗначення* умова;
  АСДЗначення* значення_так;
  АСДЗначення* значення_ні;
};

struct ТекстКоду {
  char* шлях;
  char* значення;
};

struct ПомилкаРозборуЦілі {
  Місцезнаходження* місцезнаходження;
  char* повідомлення;
};

struct РезультатРозборуЦілі {
  size_t успіх;
  СписокАСДЗначень* тіло;
  ПомилкаРозборуЦілі* помилка;
};

РезультатРозборуЦілі* розібрати_ціль(ТекстКоду* текст_коду);
char* код_операції_в_юнікод(size_t операція);
}