extern "C" {
#define АСДВидНіщо 0
#define АСДВидПеревизначити 1
#define АСДВидЗвернутись 2
#define АСДВидОтримати 3
#define АСДВидОтриматиЗіСекції 4
#define АСДВидОтриматиЗаПозицією 5
#define АСДВидЗмінити 6
#define АСДВидЗмінитиВСекції 7
#define АСДВидЗмінитиЗаПозицією 8
#define АСДВидВиконати 9
#define АСДВидВиконатиШаблон 10
#define АСДВидЦіль 11
#define АСДВидДія 12
#define АСДВидСтруктура 13
#define АСДВидСинонім 14
#define АСДВидСинонімДія 31
#define АСДВидШаблон 15
#define АСДВидСекція 16
#define АСДВидЗначенняОбʼєкт 17
#define АСДВидЗначенняБезтиповийОбʼєкт 30
#define АСДВидЗначенняЧисло 18
#define АСДВидЗначенняТекст 19
#define АСДВидОперація 21
#define АСДВидЯкщо 22
#define АСДВидПоки 23
#define АСДВидВернути 24
#define АСДВидТипДії 25
#define АСДВидТипМасиву 26
#define АСДВидТипВаріація 32
#define АСДВидЗначенняЯкщо 27
#define АСДВидЯк 28
#define АСДВидСамоОперація 29
#define АСДВидВзяти 33
#define АСДВидМітка 34
#define АСДВидСтрибнути 35 // 35

#define АСДОпераціяМноження 1
#define АСДОпераціяДілення 2
#define АСДОпераціяМодуль 3
#define АСДОпераціяДодавання 4
#define АСДОпераціяВіднімання 5
#define АСДОпераціяЗсувВліво 6
#define АСДОпераціяЗсувВправо 7
#define АСДОпераціяЗсувВправоЗнаковий 8
#define АСДОпераціяМенше 9
#define АСДОпераціяБільше 10
#define АСДОпераціяМеншеРівне 11
#define АСДОпераціяБільшеРівне 12
#define АСДОпераціяРівне 13
#define АСДОпераціяНерівне 14
#define АСДОпераціяДІ 15
#define АСДОпераціяВАБО 16
#define АСДОпераціяДАБО 17
#define АСДОпераціяІ 18
#define АСДОпераціяАБО 19

#define АСДСамоОпераціяЛогічнеНі 1
#define АСДСамоОпераціяДвійковеНі 2
#define АСДСамоОпераціяПлюс 3
#define АСДСамоОпераціяМінус 4

#define АСДВидимістьЗовнішня 0
#define АСДВидимістьМісцева 1
#define АСДВидимістьВнутрішня 2

#define АСДТипЧислаАВТО 0
#define АСДТипЧислаЦ8 1
#define АСДТипЧислаЦ16 2
#define АСДТипЧислаЦ32 3
#define АСДТипЧислаЦ64 4
#define АСДТипЧислаП8 5
#define АСДТипЧислаП16 6
#define АСДТипЧислаП32 7
#define АСДТипЧислаП64 8
#define АСДТипЧислаД32 9
#define АСДТипЧислаД64 10

struct Місцезнаходження;
struct АСДЗначення;
struct СписокАСДЗначень;

struct Ідентифікатор;
struct Параметр;
struct АргументОбʼєкта;

struct АСДДаніПеревизначити;
struct АСДДаніЗвернутись;
struct АСДДаніОтримати;
struct АСДДаніОтриматиЗіСекції;
struct АСДДаніОтриматиЗаПозицією;
struct АСДДаніЗмінити;
struct АСДДаніЗмінитиВСекції;
struct АСДДаніЗмінитиЗаПозицією;
struct АСДДаніВиконати;
struct АСДДаніВиконатиШаблон;
struct АСДДаніЦіль;
struct АСДДаніДія;
struct АСДДаніСтруктура;
struct АСДДаніСинонім;
struct АСДДаніСинонімДія;
struct АСДДаніШаблон;
struct АСДДаніСекція;
struct АСДДаніЗначенняОбʼєкт;
struct АСДДаніЗначенняБезтиповийОбʼєкт;
struct АСДДаніЗначенняЧисло;
struct АСДДаніЗначенняТекст;
struct АСДДаніОперація;
struct АСДДаніЯк;
struct АСДДаніЯкщо;
struct АСДДаніПоки;
struct АСДДаніВернути;
struct АСДДаніТипДії;
struct АСДДаніТипМасиву;
struct АСДДаніТипВаріація;
struct АСДДаніЗначенняЯкщо;
struct АСДДаніСамоОперація;
struct АСДДаніВзяти;
struct АСДДаніМітка;
struct АСДДаніСтрибнути;

struct ТекстКоду;
struct ПомилкаРозборуЦілі;
struct РезультатРозборуЦілі;

struct Місцезнаходження {
  ТекстКоду* текст_коду;
  size_t рядок;
  size_t стовпець;
};

struct АСДЗначення {
  size_t вид;
  void* дані;
  Місцезнаходження* місцезнаходження;
};

struct СписокАСДЗначень {
  size_t довжина;
  АСДЗначення** елементи;
};

struct Ідентифікатор {
  char* значення;
  Місцезнаходження* місцезнаходження;
};

struct Параметр {
  Ідентифікатор* ідентифікатор;
  АСДЗначення* тип;
  Місцезнаходження* місцезнаходження;
};

struct АргументОбʼєкта {
  Ідентифікатор* ідентифікатор;
  АСДЗначення* значення;
  Місцезнаходження* місцезнаходження;
};

struct АСДДаніПеревизначити {
  Ідентифікатор* ідентифікатор;
  АСДЗначення* значення;
};

struct АСДДаніЗвернутись {
  Ідентифікатор* ідентифікатор;
};

struct АСДДаніОтримати {
  АСДЗначення* обʼєкт;
  Ідентифікатор* ідентифікатор;
};

struct АСДДаніОтриматиЗіСекції {
  АСДЗначення* обʼєкт;
  Ідентифікатор* ідентифікатор;
};

struct АСДДаніОтриматиЗаПозицією {
  АСДЗначення* обʼєкт;
  АСДЗначення* позиція;
};

struct АСДДаніЗмінити {
  АСДЗначення* обʼєкт;
  Ідентифікатор* ідентифікатор;
  АСДЗначення* значення;
};

struct АСДДаніЗмінитиВСекції {
  АСДЗначення* обʼєкт;
  Ідентифікатор* ідентифікатор;
  АСДЗначення* значення;
};

struct АСДДаніЗмінитиЗаПозицією {
  АСДЗначення* обʼєкт;
  АСДЗначення* позиція;
  АСДЗначення* значення;
};

struct АСДДаніВиконати {
  АСДЗначення* обʼєкт;
  СписокАСДЗначень* аргументи;
};

struct АСДДаніВиконатиШаблон {
  АСДЗначення* обʼєкт;
  СписокАСДЗначень* аргументи;
};

struct АСДДаніЦіль {
  size_t видимість;
  size_t модифікатор;
  Ідентифікатор* ідентифікатор;
  АСДЗначення* тип;
  АСДЗначення* значення;
};

struct АСДДаніДія {
  size_t видимість;
  Ідентифікатор* ідентифікатор;
  size_t кількість_параметрів;
  Параметр** параметри;
  АСДЗначення* тип_результату;
  СписокАСДЗначень* тіло;
};

struct АСДДаніСтруктура {
  Ідентифікатор* ідентифікатор;
  size_t кількість_параметрів;
  Параметр** параметри;
};

struct АСДДаніСинонім {
  Ідентифікатор* ідентифікатор;
  АСДЗначення* значення;
};

struct АСДДаніСинонімДія {
  Ідентифікатор* ідентифікатор;
  АСДЗначення* значення;
};

struct АСДДаніШаблон {
  Ідентифікатор* ідентифікатор;
  size_t кількість_параметрів;
  Ідентифікатор** параметри;
  АСДЗначення* значення;
};

struct АСДДаніСекція {
  Ідентифікатор* ідентифікатор;
  СписокАСДЗначень* тіло;
};

struct АСДДаніЗначенняОбʼєкт {
  АСДЗначення* тип;
  size_t кількість_аргументів;
  АргументОбʼєкта** аргументи;
  size_t автозаповнення;
};

struct АСДДаніЗначенняБезтиповийОбʼєкт {
  size_t кількість_аргументів;
  АргументОбʼєкта** аргументи;
  size_t автозаповнення;
};

struct АСДДаніЗначенняЧисло {
  size_t база;
  char* значення;
  size_t тип;
  size_t дробове;
};

struct АСДДаніЗначенняТекст {
  Ідентифікатор* ідентифікатор;
  char* значення;
};

struct АСДДаніОперація {
  АСДЗначення* ліво;
  size_t операція;
  АСДЗначення* право;
};

struct АСДДаніЯк {
  АСДЗначення* значення;
  АСДЗначення* тип;
};

struct АСДДаніЯкщо {
  АСДЗначення* умова;
  СписокАСДЗначень* тіло;
  СписокАСДЗначень* тіло_інакше;
};

struct АСДДаніПоки {
  АСДЗначення* умова;
  СписокАСДЗначень* тіло;
};

struct АСДДаніВернути {
  АСДЗначення* значення;
};

struct АСДДаніТипДії {
  size_t кількість_параметрів;
  Параметр** параметри;
  АСДЗначення* тип_результату;
};

struct АСДДаніТипМасиву {
  АСДЗначення* тип;
  АСДЗначення* розмір;
};

struct АСДДаніТипВаріація {
  СписокАСДЗначень* типи;
};

struct АСДДаніЗначенняЯкщо {
  АСДЗначення* умова;
  АСДЗначення* значення_так;
  АСДЗначення* значення_ні;
};

struct АСДДаніСамоОперація {
  size_t операція;
  АСДЗначення* обʼєкт;
};

struct АСДДаніВзяти {
  Ідентифікатор* тип;
  size_t довжина_шляху;
  Ідентифікатор** шлях;
  size_t відносно;
};

struct АСДДаніМітка {
  Ідентифікатор* ідентифікатор;
};

struct АСДДаніСтрибнути {
  Ідентифікатор* ідентифікатор;
};

struct ТекстКоду {
  char* шлях;
  char* значення;
};

struct ПомилкаРозборуЦілі {
  Місцезнаходження* місцезнаходження;
  char* повідомлення;
};

struct РезультатРозборуЦілі {
  size_t успіх;
  СписокАСДЗначень* тіло;
  ПомилкаРозборуЦілі* помилка;
};

РезультатРозборуЦілі* розібрати_ціль(ТекстКоду* текст_коду);
char* код_операції_в_юнікод(size_t операція);
}