#!/usr/bin/env bash

set -e

export CXX="clang++"
export CC="clang"
export AR="llvm-ar"
export RANLIB="llvm-ranlib"

KTS_FILES=(
  "Обʼєкт.ц"
  "ОбʼєктГрупиДій.ц"
  "ОбʼєктДії.ц"
  "ОбʼєктЗначення.ц"
  "ОбʼєктНезавантаженогоЗначення.ц"
  "ОбʼєктСекції.ц"
  "ОбʼєктСирогоЗначення.ц"
  "ОбʼєктТипу.ц"
  "ОбʼєктШаблону.ц"
  "Помилка.ц"
  "Середовище.ц"
  "Тип.ц"
  "Ц.ц"
  "К/К.ц"
  "К/КВернути.ц"
  "К/КВиконати.ц"
  "К/КВиконатиШаблон.ц"
  "К/КЗвернутись.ц"
  "К/КЗмінити.ц"
  "К/КЗмінитиВСекції.ц"
  "К/КЗмінитиЗаПозицією.ц"
  "К/КЗначенняОбʼєкт.ц"
  "К/КЗначенняТекст.ц"
  "К/КЗначенняЧисло.ц"
  "К/КЗначенняЯкщо.ц"
  "К/КОперація.ц"
  "К/КОтримати.ц"
  "К/КОтриматиЗаПозицією.ц"
  "К/КОтриматиЗіСекції.ц"
  "К/КПеревизначити.ц"
  "К/КПоки.ц"
  "К/КСамоОперація.ц"
  "К/КДія.ц"
  "К/КСекція.ц"
  "К/КСинонім.ц"
  "К/КСтруктура.ц"
  "К/КТип.ц"
  "К/КЦіль.ц"
  "К/КШаблон.ц"
  "К/КЯк.ц"
  "К/КЯкщо.ц"
)


PWDR="$(pwd)"

cd КЦ
for KTS_FILE in "${KTS_FILES[@]}"; do
  CHANGED_AT=$(stat -c %y $KTS_FILE)
  CHANGED_AT_OLD=$(cat "../.плавлення/скомпільоване/$KTS_FILE.ll.changed_at" 2>/dev/null || echo "")
  if [ ! -f "../.плавлення/скомпільоване/$KTS_FILE.ll" ] || [ "$CHANGED_AT" != "$CHANGED_AT_OLD" ]; then
    echo "../build-old/ціль ../.плавлення/скомпільоване/$KTS_FILE.ll скомпілювати --бібліотека=$PWDR/.плавлення-бібліотеки/бібліотека $KTS_FILE"
    ../build-old/ціль ../.плавлення/скомпільоване/"$KTS_FILE".ll скомпілювати --бібліотека="$PWDR/.плавлення-бібліотеки/бібліотека" "$KTS_FILE"
    echo "$CXX -c -o ../.плавлення/скомпільоване/$KTS_FILE.o ../.плавлення/скомпільоване/$KTS_FILE.ll -Wno-override-module"
    $CXX -c -o ../.плавлення/скомпільоване/"$KTS_FILE".o ../.плавлення/скомпільоване/"$KTS_FILE".ll -Wno-override-module
    echo "$CHANGED_AT" > "../.плавлення/скомпільоване/$KTS_FILE.ll.changed_at"
  fi
done
cd ..

mkdir -p build
cd build
cmake ../external/ -G Ninja -DCMAKE_CXX_FLAGS=-fdiagnostics-color=always
ninja
cd ..
