#!/usr/bin/env bash

set -e
set -x

TSIL="$1"
if [ -z "$TSIL" ]; then
  TSIL="ціль"
fi
# check if build/ціль exist
if [ -f "build/ціль" ]; then
  cp -r "build/ціль" "build/ціль-$(date +%s)"
fi

export CXX="clang++"
export CC="clang"
export AR="llvm-ar"
export RANLIB="llvm-ranlib"

KTS_FILES=(
  "КД/КД.ю8.ц"
  "біб.ю8.ц"
  "Назва.ю8.ц"
  "Обʼєкт.ю8.ц"
  "ОбʼєктГрупиДій.ю8.ц"
  "ОбʼєктДії.ю8.ц"
  "ОбʼєктЗначення.ю8.ц"
  "ОбʼєктНезавантаженогоЗначення.ю8.ц"
  "ОбʼєктСекції.ю8.ц"
  "ОбʼєктСирогоЗначення.ю8.ц"
  "ОбʼєктТипу.ю8.ц"
  "ОбʼєктШаблону.ю8.ц"
  "Помилка.ю8.ц"
  "Середовище.ю8.ц"
  "Тип.ю8.ц"
  "Ц.ю8.ц"
  "К/К.ю8.ц"
  "К/КВернути.ю8.ц"
  "К/КВзяти.ю8.ц"
  "К/КВиконати.ю8.ц"
  "К/КВиконатиШаблон.ю8.ц"
  "К/КЗвернутись.ю8.ц"
  "К/КЗмінити.ю8.ц"
  "К/КЗмінитиВСекції.ю8.ц"
  "К/КЗмінитиЗаПозицією.ю8.ц"
  "К/КОбʼєкт.ю8.ц"
  "К/КТекст.ю8.ц"
  "К/КЧисло.ю8.ц"
  "К/КЗначенняЯкщо.ю8.ц"
  "К/КОперація.ю8.ц"
  "К/КОтримати.ю8.ц"
  "К/КОтриматиЗаПозицією.ю8.ц"
  "К/КОтриматиЗіСекції.ю8.ц"
  "К/КПерезаписати.ю8.ц"
  "К/КПерелік.ю8.ц"
  "К/КПоки.ю8.ц"
  "К/КСамоОперація.ю8.ц"
  "К/КДія.ю8.ц"
  "К/КСекція.ю8.ц"
  "К/КСинонім.ю8.ц"
  "К/КСтруктура.ю8.ц"
  "К/КТип.ю8.ц"
  "К/КЦіль.ю8.ц"
  "К/КШаблон.ю8.ц"
  "К/КЯк.ю8.ц"
  "К/КЯкщо.ю8.ц"
  "К/КЄ.ю8.ц"
)

PWDR="$(pwd)"

cd КЦ
for KTS_FILE in "${KTS_FILES[@]}"; do
  CHANGED_AT=$(stat -c %y $KTS_FILE)
  CHANGED_AT_OLD=$(cat "../.плавлення-КЦ/скомпільоване/$KTS_FILE.ll.changed_at" 2>/dev/null || echo "")
  if [ ! -f "../.плавлення-КЦ/скомпільоване/$KTS_FILE.ll" ] || [ "$CHANGED_AT" != "$CHANGED_AT_OLD" ]; then
    $TSIL "../.плавлення-КЦ/скомпільоване/$KTS_FILE.ll" скомпілювати "$KTS_FILE"

    $CXX -O3 -c -o "../.плавлення-КЦ/скомпільоване/$KTS_FILE.o" "../.плавлення-КЦ/скомпільоване/$KTS_FILE.ll" -Wno-override-module

    echo "$CHANGED_AT" > "../.плавлення-КЦ/скомпільоване/$KTS_FILE.ll.changed_at"
  fi
done
cd ..

mkdir -p build
cd build
cmake ../external/ -G Ninja \
  -DCMAKE_CXX_FLAGS=-fdiagnostics-color=always \
  -DTSIL_LLVM_PATH="../../.llvm-source-and-build/llvm-project-19.1.0.build/llvm"
ninja
cd ..
