extern "C" {
#define АСДВидНіщо 0
#define АСДВидВизначити 1
#define АСДВидЗвернутись 2
#define АСДВидОтримати 3
#define АСДВидОтриматиЗіСекції 4
#define АСДВидОтриматиЗаПозицією 5
#define АСДВидЗмінити 6
#define АСДВидЗмінитиВСекції 7
#define АСДВидЗмінитиЗаПозицією 8
#define АСДВидВиконати 9
#define АСДВидВиконатиШаблон 10
#define АСДВидСтворитиЦіль 11
#define АСДВидСтворитиДію 12
#define АСДВидСтворитиСтруктуру 13
#define АСДВидСтворитиСинонім 14
#define АСДВидСтворитиШаблон 15
#define АСДВидСтворитиСекцію 16
#define АСДВидСтворитиОбʼєкт 17
#define АСДВидЗначенняЧисло 18
#define АСДВидЗначенняТекст 19
#define АСДВидЗначенняЮнікод 20

struct Місцезнаходження;
struct АСДЗначення;
struct СписокАСДЗначень;

struct Ідентифікатор;
struct Параметр;

struct АСДДаніВизначити;
struct АСДДаніЗвернутись;
struct АСДДаніОтримати;
struct АСДДаніОтриматиЗіСекції;
struct АСДДаніОтриматиЗаПозицією;
struct АСДДаніЗмінити;
struct АСДДаніЗмінитиВСекції;
struct АСДДаніЗмінитиЗаПозицією;
struct АСДДаніВиконати;
struct АСДДаніВиконатиШаблон;
struct АСДДаніСтворитиЦіль;
struct АСДДаніСтворитиДію;
struct АСДДаніСтворитиСтруктуру;
struct АСДДаніСтворитиСинонім;
struct АСДДаніСтворитиШаблон;
struct АСДДаніСтворитиСекцію;
struct АСДДаніСтворитиОбʼєкт;
struct АСДДаніЗначенняЧисло;
struct АСДДаніЗначенняТекст;
struct АСДДаніЗначенняЮнікод;

struct ТекстКоду;
struct ПомилкаРозборуЦілі;
struct РезультатРозборуЦілі;

struct Місцезнаходження {
  ТекстКоду* текст_коду;
  size_t рядок;
  size_t стовпець;
};

struct АСДЗначення {
  size_t вид;
  void* дані;
  Місцезнаходження* місцезнаходження;
};

struct СписокАСДЗначень {
  size_t довжина;
  АСДЗначення** елементи;
};

struct Ідентифікатор {
  char* значення;
  Місцезнаходження* місцезнаходження;
};

struct Параметр {
  Ідентифікатор* ідентифікатор;
  АСДЗначення* тип;
  Місцезнаходження* місцезнаходження;
};

struct АСДДаніВизначити {
  Ідентифікатор* ідентифікатор;
  АСДЗначення* обʼєкт;
};

struct АСДДаніЗвернутись {
  Ідентифікатор* ідентифікатор;
};

struct АСДДаніОтримати {
  АСДЗначення* обʼєкт;
  Ідентифікатор* ідентифікатор;
};

struct АСДДаніОтриматиЗіСекції {
  АСДЗначення* обʼєкт;
  Ідентифікатор* ідентифікатор;
};

struct АСДДаніОтриматиЗаПозицією {
  АСДЗначення* обʼєкт;
  АСДЗначення* позиція;
};

struct АСДДаніЗмінити {
  АСДЗначення* обʼєкт;
  Ідентифікатор* ідентифікатор;
  АСДЗначення* значення;
};

struct АСДДаніЗмінитиВСекції {
  АСДЗначення* обʼєкт;
  Ідентифікатор* ідентифікатор;
  АСДЗначення* значення;
};

struct АСДДаніЗмінитиЗаПозицією {
  АСДЗначення* обʼєкт;
  АСДЗначення* позиція;
  АСДЗначення* значення;
};

struct АСДДаніВиконати {
  АСДЗначення* обʼєкт;
  СписокАСДЗначень аргументи;
};

struct АСДДаніВиконатиШаблон {
  АСДЗначення* обʼєкт;
  СписокАСДЗначень аргументи;
};

struct АСДДаніСтворитиЦіль {
  size_t змінна;
  size_t стала;
  АСДЗначення* тип;
};

struct АСДДаніСтворитиДію {
  Ідентифікатор* ідентифікатор;
  size_t кількість_параметрів;
  Параметр** параметри;
  АСДЗначення* тип_результату;
};

struct АСДДаніСтворитиСтруктуру {
  Ідентифікатор* ідентифікатор;
  size_t кількість_параметрів;
  Параметр** параметри;
};

struct АСДДаніСтворитиСинонім {
  АСДЗначення* значення;
};

struct АСДДаніСтворитиШаблон {
  size_t кількість_параметрів;
  Параметр** параметри;
  АСДЗначення* значення;
};

struct АСДДаніСтворитиСекцію {
  Ідентифікатор* ідентифікатор;
};

struct АСДДаніСтворитиОбʼєкт {
  АСДЗначення* тип;
  СписокАСДЗначень аргументи;
};

struct АСДДаніЗначенняЧисло {
  char* значення;
};

struct АСДДаніЗначенняТекст {
  unsigned char* значення;
};

struct АСДДаніЗначенняЮнікод {
  char* значення;
};

struct ТекстКоду {
  char* шлях;
  char* значення;
};

struct ПомилкаРозборуЦілі {
  Місцезнаходження* місцезнаходження;
  char* повідомлення;
};

struct РезультатРозборуЦілі {
  size_t успіх;
  СписокАСДЗначень тіло;
  ПомилкаРозборуЦілі* помилка;
};

РезультатРозборуЦілі розібрати_ціль(ТекстКоду* текст_коду);
}