#!/usr/bin/env bash

set -e

export CXX="clang++"
export CC="clang"
export AR="llvm-ar"
export RANLIB="llvm-ranlib"
#export CXX="zig c++"
#export CC="zig cc"
#export AR="zig ar"
#export RANLIB="zig ranlib"
export USE_JEMALLOC=no
export USE_SYSTEMD=no

rm -rf .плавлення-бібліотеки/

mkdir -p .плавлення-бібліотеки/бібліотека/
cp -a бібліотека/визначення/біб .плавлення-бібліотеки/бібліотека/

./build-bin/ціль .плавлення-бібліотеки/скомпільоване/друк/друк.ц.ll скомпілювати --бібліотека=.плавлення-бібліотеки/бібліотека/ бібліотека/втілення/біб/друк/друк.ц
$CC -c -o .плавлення-бібліотеки/скомпільоване/друк/друк.c.o бібліотека/втілення/біб/друк/друк.c
./build-bin/ціль .плавлення-бібліотеки/скомпільоване/юнікод/юнікод.ц.ll скомпілювати --бібліотека=.плавлення-бібліотеки/бібліотека/ бібліотека/втілення/біб/юнікод/юнікод.ц

$CXX -c -o .плавлення-бібліотеки/скомпільоване/друк/друк.ц.o .плавлення-бібліотеки/скомпільоване/друк/друк.ц.ll
$CXX -c -o .плавлення-бібліотеки/скомпільоване/юнікод/юнікод.ц.o .плавлення-бібліотеки/скомпільоване/юнікод/юнікод.ц.ll

$AR rcs .плавлення-бібліотеки/бібліотека/біб.a .плавлення-бібліотеки/скомпільоване/друк/друк.ц.o .плавлення-бібліотеки/скомпільоване/друк/друк.c.o .плавлення-бібліотеки/скомпільоване/юнікод/юнікод.ц.o