#!/usr/bin/env bash

set -e

rm -rf .плавлення-бібліотеки/

mkdir -p .плавлення-бібліотеки/бібліотека/
cp -a бібліотека/визначення/біб .плавлення-бібліотеки/бібліотека/

./build-bin/ціль .плавлення-бібліотеки/скомпільоване/друк/друк.ц.ll скомпілювати --бібліотека=.плавлення-бібліотеки/бібліотека/ бібліотека/втілення/біб/друк/друк.ц
clang++ -c -o .плавлення-бібліотеки/скомпільоване/друк/друк.cpp.o бібліотека/втілення/біб/друк/друк.cpp
./build-bin/ціль .плавлення-бібліотеки/скомпільоване/юнікод/юнікод.ц.ll скомпілювати --бібліотека=.плавлення-бібліотеки/бібліотека/ бібліотека/втілення/біб/юнікод/юнікод.ц

clang++ -c -o .плавлення-бібліотеки/скомпільоване/друк/друк.ц.o .плавлення-бібліотеки/скомпільоване/друк/друк.ц.ll
clang++ -c -o .плавлення-бібліотеки/скомпільоване/юнікод/юнікод.ц.o .плавлення-бібліотеки/скомпільоване/юнікод/юнікод.ц.ll

llvm-ar rcs .плавлення-бібліотеки/бібліотека/біб.a .плавлення-бібліотеки/скомпільоване/друк/друк.ц.o .плавлення-бібліотеки/скомпільоване/друк/друк.cpp.o .плавлення-бібліотеки/скомпільоване/юнікод/юнікод.ц.o